Repository: flitenym/BinFC
Catalog: Server/BinFC/WorkerService.Module/Localization/WorkerServiceLoc.*.resx
Languages: ru

# Empty
source: An empty entity has been sent.
ru: Отправлена пустая сущность.

# IncorrectCronFormat
source: Invalid Cron format: {0}
ru: Неверный формат Cron: {0}

# ErrorGetOccurrences
source: Error receiving the following sales service execution dates.
ru: Ошибка получения следующих дат выполнения сервиса продажи.

# CanNotStartService
source: The sales service could not be started because the cron entry in the database was not found.
ru: Не удалось запустить сервис продажи, т.к. не найдена cron запись в БД.

# CanNotGetCronExpression
source: Failed to get cron record.
ru: Не удалось получить cron запись.

# StartHostedServer
source: The service for sending messages has started.
ru: Сервис по отправке сообщений стартовал.

# StopHostedServer
source: The service for sending messages has stopped.
ru: Сервис по отправке сообщений остановился.

# SendNotificationText
source: A notification was sent to a user with a chatId {0}: {1}.
ru: Отправлено уведомление пользователю с chatId {0}: {1}.

# SendNotificationError
source: Error sending messages.
ru: Ошибка отправки сообщений.

# NotApproveUserInfo
source: Failure error for more than a week.
ru: Ошибка отказа более недели.

# StartService
source: Starting the service {0}.
ru: Запуск службы {0}.

# StopService
source: Stopping the service {0}.
ru: Остановка службы {0}.

# RestartService
source: Restarting the service {0}.
ru: Перезапуск службы {0}.

# StartBinanceSellDoWork
source: Starting a sale.
ru: Запуск продажи.

# SellSuccess
source: The sale was successful.
ru: Продажа прошла успешно.

# SellUnsuccess
source: The sale was unsuccessful.
ru: Продажа прошла неудачно.

# SellWithErrors
source: The sale went wrong {0}.
ru: Продажа прошла с ошибками {0}.

# StartTransferFuturesToSpot
source: Starting the transfer of {0} from futures to spot.
ru: Начинаем перевод {0} из фьючерс в спот.

# TransferSuccess
source: The transfer of {0} from futures to spot was carried out. {1}.
ru: Перевод {0} из фьючерс в спот был осуществлен. {1}.

# TransferUnsuccess
source: The transfer of {0} from futures to spot was not carried out. {1}.
ru: Перевод {0} из фьючерс в спот не был осуществлен. {1}.

# GetExchangeInfoError
source: Error in obtaining information about the minimum requirements for symbols for translation. {0}.
ru: Ошибка получения информации минимальных требований по символам для перевода. {0}.

# GetCurrenciesError
source: Error receiving currencies. {0}.
ru: Ошибка получения валют. {0}.

# CurrenciesEmpty
source: No coins for sale.
ru: Нет монет для продажи.

# StartSellCurrencies
source: Start selling coins {0}.
ru: Начинаем продажу монет {0}.

# EndSellCurrencies
source: Coin sale completed.
ru: Продажа монет выполнена.

# StartDustSell
source: We are starting to transfer coins with a small balance to BNB.
ru: Начинаем перевод монет с маленьким балансом в BNB.

# StartDustSellSuccess
source: The transfer of coins with a small balance to BNB is finished.
ru: Перевод монет с маленьким балансом в BNB закончен.

# StartDustSellUnsuccess
source: The transfer of coins with a small balance to BNB is finished. {0}
ru: Перевод монет с маленьким балансом в BNB закончен. {0}

# SellCurrency
source: Sale {0}
ru: Продажа {0}

# GetCurrencyUnsuccess
source: Sale {0}: unsuccessful receipt of currency. {1}.
ru: Продажа {0}: неудачное получение валюты. {1}.

# StartNotDustCurrency
source: Sale {0}: make a sale.
ru: Продажа {0}: выполним продажу.

# SellNotDustCurrency
source: Sale {0}:{1} the sale was completed by {2}. {3}.
ru: Продажа {0}:{1} выполнилась продажа по {2}. {3}.

# NotificationMessageText
source: Message to the administrator:{0}{1}.
ru: Сообщение для администратора:{0}{1}.

# NotificationDisabled
source: Notifications are disabled.
ru: Уведомления отключены.

# NotFoundAdmins
source: No administrators found to send the notification.
ru: Администраторов не найдено для отправки уведомления.

# SendedNotification
source: A notification has been sent to the user {adminChatId}: {message}.
ru: Отправлено уведомление пользователю {adminChatId}: {message}.

# No
source: not
ru: не
