Repository: flitenym/BinFC
Catalog: Server/BinFC/BinanceApi.Module/Localization/BinanceApiLoc.*.resx
Languages: ru

# NotSpecified
source: Not specified {0}.
ru: Не указан {0}.

# Error2015
source: There are no ApiKey/Api Secret or the action is not allowed, enable the appropriate rights in the Api settings.
ru: Отсутствуют ApiKey/ApiSecret или действие не разрешено, включите в настройках Api соответствующие права.

# Error2008
source: Invalid ApiKey/ApiSecret.
ru: Неверный ApiKey/ApiSecret.

# Error32110
source: The transfer of coins with a small balance is not completed, because it can be made once every 6 hours.
ru: Перевод монет с маленьким балансом не выполнен, т.к. можно производить раз в 6 часов.

# FuturesHaveNotCurrency
source: In futures there is no {0}.
ru: Во фьючерсе нет {0}.

# FuturesAccountHaveNotCurrency
source: Error. Asset {0} not found in the Futures Wallet.
ru: Ошибка. Не найдена монета {0} во Фьючерсном кошельке.

# AssetInfoWithDust
source: For {0} ({1}) the quantity was determined as {2} from {3}({4}), {5}.
ru: Для {0} ({1}) количество определилось как {2} из {3}({4}), {5}.

# NotFoundAsset
source: Not found asset {0}.
ru: Не найдена монета {0}.

# SellAssetError
source: Currency sale error {0}{1}. {2}.{3}
ru: Ошибка продажи валюты {0}{1}. {2}.{3}

# HaveNotDustAssets
source: There are no coins with a small balance.
ru: Нет монет с маленьким балансом.

# HaveDustAssets
source: Coins with a small balance: {0}.
ru: Монеты с маленьким балансом: {0}.

# HaveNotSymbolInfo
source: No filters found for {0}.
ru: Не найдены фильтры для {0}.

# HaveNotPriceInfo
source: Couldn't get a price for {0}{1}.
ru: Не удалось получить цену для {0}{1}.

# SellResultInfoZero
source: The resulting value for {0} = 0.
ru: Полученное значение для {0} = 0.

# LotSizeSuccess
source: The check for LOT_SIZE passed.
ru: Проверку на LOT_SIZE прошло.

# MinNotionalSuccess
source: The check for MIN_NOTIONAL passed.
ru: Проверку на MIN_NOTIONAL прошло.

# MinNotionalNotSuccess
source: The check for MIN_NOTIONAL not passed.
ru: Проверку на MIN_NOTIONAL не прошло.

# NetworksNotFound
source: Could not determine the network to output.
ru: Не удалось определить сеть для вывода.

# NetworkWithdrawDisabled
source: Output is prohibited for {0}.
ru: Для {0} запрещен вывод.

# ScalesNotFound
source: {0}. You must specify the ruler.
ru: {0}. Необходимо указать линейку.

# GetSettingsPercent
source: {0}. There is no data on the percentage in the settings.
ru: {0}. Нет данных по проценту в настройках.

# DataNotFound
source: {0}. There is no data for receiving payment information.
ru: {0}. Нет данных для получения информации оплаты.

# NeedTwoExcelFiles
source: {0}. You need to import 2 different excel files.
ru: {0}. Необходимо импортировать 2 разных эксель файла.

# NeedScalesForUser
source: {0}. It is necessary to specify a scale for the user {1}.
ru: {0}. Необходимо указать шкалу для пользователя {1}.

# Empty
source: An empty entity has been sent.
ru: Отправлена пустая сущность.

# BalanceLess
source: Balance {BinanceKeys.USDT}: {(usdt?.Available ?? 0)}, and for payments: {trcBalance}.
ru: Баланс по {BinanceKeys.USDT}: {(usdt?.Available ?? 0)}, а по выплатам: {trcBalance}.

# PursesEmpty
source: Failed to identify the user's wallet {0}.
ru: Не удалось определить кошелек у пользователя {0}.

# CanNotCreatePayHistory
source: Failed to create a history entry for a user with Id {0}: {1}.
ru: Не удалось создать запись в истории для пользователя с Id {0}: {1}.

# CanNotSendMoney
source: Failed to send to user with Id {0}: {1}.
ru: Не удалось отправить пользователю с Id {0}: {1}.

# WithdrawMinLessPay
source: Payment of the amount {0} is less than the minimum amount to transfer {1} to {2}.
ru: Оплата суммы {0} меньше чем минимальная сумма для перевода {1} по {2}.

# PaySuccess
source: Payment has occurred.
ru: Оплата произошла.

# PayUnsuccess
source: Payment failed.
ru: Оплата не произошла.

source: Balance
ru: Баланс

# PayUserInfo
source: Cashback in the amount of {0}$ has been sent to you.
ru: Вам отправлен кэшбэк на сумму {0}$
