Repository: flitenym/BinFC
Catalog: Server/BinFC/TelegramFatCamel.Module/Localization/TelegramLoc.*.resx
Languages: ru

# AcceptedPurse
source: Wallet accepted.
ru: Кошелек принят.

# AcceptEmail
source: Your specified e-mail has been accepted.
ru: Ваш указанный e-mail принят.

# AcceptEmailWithExisted
source: Your specified e-mail has been accepted. E-mail was specified: {0}
ru: Ваш указанный e-mail принят. E-mail был указан: {0}

# AcceptName
source: Your specified SN is accepted.
ru: Ваше указанное ФИ принято.

# AcceptNameWithExisted
source: Your specified SN is accepted. SN was specified: {0}
ru: Ваше указанное ФИ принято. ФИ было указано: {0}

# AlreadyInputIdCommand
source: You are already connected to the base. Specify the command to view the cabinet: {0}
ru: Вы уже привязаны к базе. Укажите команду для просмотра кабинета: {0}

# ChatIdExist
source: The specified identifier is already registered in the database. Try again with command: {0}
ru: Указанный Id уже зарегестрирован в базе. Повторите снова, указав команду: {0}

# ChoosePurse
source: Choose a wallet.
ru: Выберите кошелек.

# ErrorTextToSendAdmin
source: An error has occurred, contact the Administrator.
ru: Произошла ошибка, обратитесь к Администратору.

# IdNotRegister
source: This Id is not registered in the database. The administrator will check the data and you will receive a message.
ru: Данный Id не зарегистрирован в базе. Администратор проверит данные и вам придет сообщение.

# IdUnspecified
source: Id is not specified, bind Id first. You can specify Id by writing the command: {0}
ru: Id не указан, привяжите сперва Id. Указать Id можно написав команду: {0}

# IncorrectId
source: Id entered incorrectly. Try it again.
ru: Неверно введен Id. Попробуйте снова.

# InputBep
source: Enter your BEP wallet.
ru: Введите BEP кошелек.

# InputEmail
source: Enter e-mail.
ru: Введите e-mail.

# InputEmailEmpty
source: Email is empty. Try again with command: {0}
ru: E-mail пустой. Повторите снова, указав команду: {0}

# InputId
source: Enter Id.
ru: Введите Id.

# InputName
source: Enter SN.
ru: Введите ФИ.

# InputNameEmpty
source: SN is empty. Try again with command: {0}
ru: ФИ пустое. Повторите снова, указав команду: {0}

# InputTrc
source: Enter TRC wallet.
ru: Введите TRC кошелек.

# Operations
source: Available commands: Id: {0} Change wallet: {1} SN indication: {2} E-mail indication: {3} Private area: {4} Change language: {5}
ru: Доступные команды: Указание Id: {0} Изменение кошелька: {1} Указание ФИ: {2} Указание e-mail: {3} Личный кабинет: {4}

# PrivateId
source: Id: {0}
ru: ИД: {0}

# PrivateName
source: SN: {0}
ru: ФИ: {0}

# StartCommand
source: Welcome! I will help register Fat Camel! To get a list of commands type "{0}" or click the button.
ru: Добро пожаловать! Я буду помогать в регистрации Fat Camel! Для получения списка комманд напишите "{0}" или нажмите на кнопку.

# StatusApprove
source: Status: approved.
ru: Статус: активирован.

# StatusNotApprove
source: Status: not approved.
ru: Статус: неактивирован.
